[
    {
         
        "Name":"October 6 University",
        "Description":"The October 6 University is the first private university in the Arab Republic of Egypt. O6U is instituted by the Republican Decree number 243 1996. The university is a member of the Association of Arab Universities and the Association of African Universities. The University includes thirteen Faculties, University Hospital, and two hotels for male and female students. It has also established a center for quality assurance and accreditation having units in all the faculties, to enhance and disseminate quality culture. The University comprises a modern library.",
        "Location":"6th of October City, Giza Governorate",
        "Required Documents":"Original General Secondary Certificate or an official transcript approved by the Educational Administration.\nOriginal birth certificate.\nEnrollment certificate from the university for the previous academic year (for holders of the 2023 certificate).\nPhotocopy of the national ID card or passport.\nPhotocopy of the father’s national ID card (for male students).\nMilitary Form 2 and Form 6 (for male students born in 2005).",
        "UniversityType":"Private",
        "Degree Type":"An Egyptian Degree – Accredited by the Supreme Council of Universities in Egypt, allowing graduates to work in Egypt and the region.",
        "Rank":"171-180",
        "LearningStyle":"Focuses on practical training and skill-based learning to enhance job market competitiveness.",
        "UniEmail":"adminoct@o6u.edu.eg",
        "UniPhone":"16704",
        "PrimaryLanguage":"English&Arabic",
        "Website URL":"https:\/\/o6u.edu.eg\/",
        "Picture URL":" "
    },
    {
        
        "Name":"MSA University",
        "Description":" October University for Modern Sciences and Arts (MSA University) is a private university located in Giza, Egypt, established in 1996 by Dr. Nawal El-Degwi. \n\n It offers British-style higher education and has ten faculties: Computer Science, Pharmacy, Mass Communication, Management Sciences, Engineering, Biotechnology, Arts and Design, Oral and Dental Medicine, Languages, and Physiotherapy. MSA was the first Egyptian university to validate its programs with British universities in 2002, granting graduates dual bachelor's degrees—one from an Egyptian institution accredited by the Supreme Council for Universities and another from UK universities such as Bedfordshire or Greenwich.",
        "Location":"26 July Mehwar Road intersection with Wahat Road, 6th October City. Egypt.",
        "Required Documents":"General Requirements for All Certificates: 5 Personal Photos – عدد 5 صور شخصية\nBirth Certificate:\nFor Egyptians: (2) Computerized Birth Certificates – للطلاب المصريين، (2) أصل شهادة ميلاد حديثة\nFor Non-Egyptians: Authenticated Birth Certificate from Embassy and The Egyptian Ministry of Foreign Affairs – أصل شهادة الميلاد موثقة من سفارة الطالب والخارجية المصرية لغير المصريين\nStudent's and Parent's National ID – إثبات شخصية الطالب وولي الأمر\nCopy of Student's Passport (if available) – صورة جواز سفر الطالب إن وجد\nFor Egyptian Male Students:\nNamouzag 2 + (6 or 7) Gond – للطلاب المصريين من الذكور، نموذج 2 +( 6 أو 7) جند",
        "UniversityType":"private university",
        "Degree Type":"MSA University offers dual degrees, meaning graduates receive:\n\nAn Egyptian Degree – Accredited by the Supreme Council of Universities in Egypt, allowing graduates to work in Egypt and the region.\nA British Degree – Awarded by partner UK universities (such as the University of Greenwich or University of Bedfordshire), making it internationally recognized.",
        "Rank":"Ranked 146th in the QS Arab Region Rankings 2025.",
        "LearningStyle":"Follows British education standards, emphasizing creativity and lifelong learning.",
        "UniEmail":"info@msa.edu.eg",
        "UniPhone":"16672",
        "PrimaryLanguage":"English ",
        "Website URL":"https:\/\/msa.edu.eg\/",
        "Picture URL":" "
    },
    {
      
        "Name":"Misr University for Science and Technology (MUST)",
        "Description":"Misr University for Science and Technology (MUST) is a private university in Egypt, established in 1996. It is recognized by the Supreme Council of Universities and follows international academic standards. MUST provides a wide range of undergraduate and postgraduate programs across various faculties. The university focuses on research, innovation, and practical training, offering students access to modern laboratories, libraries, and clinical training facilities. MUST also maintains collaborations with international institutions, ensuring a high-quality educational experience.",
        "Location":"Address: Al Motamayez District – 6th of October, Egypt",
        "Required Documents":"General Requirements:Completed Application Form, Official General Secondary Education Certificate, Birth Certificate, 6 Passport-sized Photos, Copy of National ID (Egyptians) or Passport (Non-Egyptians)\/\/For Male Egyptian StudentsForm \"2 GOND\" (from post office), Military Card (for those above 19), Official Military Status Document (for those above 22)Education-Specific Requirements,English Placement TestRequired for all new students to determine English course levels",
        "UniversityType":"private university",
        "Degree Type":"(MUST) offers Egyptian degrees that are fully accredited by the Supreme Council of Universities in Egypt.However, MUST follows international academic standards and has partnerships with global institutions, making its degrees recognized in some international contexts.For students planning to work or continue studies abroad, degree recognition depends on the country and the specific university or employer. Some degrees may require equivalency certification or further accreditation based on the destination country.",
        "Rank":"Ranked 24th among Egyptian institutions.",
        "LearningStyle":"Uses a student-centered approach with both in-campus and online education methods.",
        "UniEmail":"info@must.edu.eg",
        "UniPhone":"16878",
        "PrimaryLanguage":"English ",
        "Website URL":"https:\/\/must.edu.eg\/",
        "Picture URL":" "
    },
    {
         
        "Name":"American University in Cairo (AUC)",
        "Description":"The American University in Cairo (AUC) is a prestigious private university in Egypt, known for its high academic standards and strong emphasis on liberal arts education. Established in 1919, AUC offers a diverse range of undergraduate, graduate, and professional programs in fields such as engineering, business, social sciences, humanities, and global affairs.\n\nLocated in New Cairo, AUC’s modern campus features state-of-the-art facilities, including advanced research centers, libraries, and cultural venues. The university follows an American-style curriculum and conducts most of its courses in English, attracting students from Egypt and around the world.\n\nAUC is also recognized for its strong research output, international partnerships, and vibrant student life, which includes numerous clubs, sports, and extracurricular activities. It is accredited in both the U.S. and Egypt, making its degrees highly valuable globally.",
        "Location":"Fifth Settlement , New Cairo",
        "Required Documents":"\nApplication Form: Complete and submit the online application form available on the AUC admissions website.\n\nOfficial Transcripts: Provide official transcripts from all secondary schools, universities, or colleges attended.\n\nStandardized Test Scores: Submit standardized test scores as required by the specific program or educational background.\n\nProof of English Proficiency: Non-native English speakers must provide proof of English proficiency through tests such as the International TOEFL, Academic IELTS, or Duolingo scores.\n\nRecommendation Letters: Submit letters of recommendation as specified by the program.\n\nPersonal Statement or Essay: Provide a personal statement or essay as required by the program.\n\nMedical Examination Report: Submit a recent medical report stating that the student is physically and mentally capable of undertaking university work.",
        "UniversityType":"International ",
        "Degree Type":"(AUC) awards degrees that are accredited both in Egypt and the United States.",
        "Rank":"2",
        "LearningStyle":"AUC follows an American-style liberal arts education, emphasizing critical thinking, interdisciplinary learning, interactive classes, and real-world applications.",
        "UniEmail":"enrolauc@aucegypt.edu.",
        "UniPhone":"19282",
        "PrimaryLanguage":"English",
        "Website URL":"https:\/\/www.aucegypt.edu\/",
        "Picture URL":" "
    },
    {
         
        "Name":"University Of London",
        "Description":"The University of London, hosted by the European University of Egypt (EUE) in Egypt's New Administrative Capital, offers globally recognized degrees in a modern, state-of-the-art campus. Students can access world-class programs in business, law, economics, and more, combining the University of London's academic excellence with Egypt's vibrant cultural and professional opportunities. This partnership provides a prestigious, internationally accredited education in a dynamic and forward-thinking environment.",
        "Location":"New Capital City ",
        "Required Documents":"Original Diploma Certificate: Authenticated by relevant educational authorities.​\n\nOfficial Transcripts: Detailed records of academic performance.​\n\nProof of 12 Years of Schooling: Documentation verifying completion of the required years of education.​\n\nOriginal Birth Certificate: For identity verification.​\n\nPassport-Sized Photographs: Typically six recent photos.​\n\nMilitary Service Documents: Applicable to Egyptian male students, including Form 2 Gond and, if born in 2005 or earlier, a fully stamped Form 7 Gond.",
        "UniversityType":"International ",
        "Degree Type":"UK-accredited Degree ",
        "Rank":"Not Ranked",
        "LearningStyle":"a theoretical and practical learning approach, combining academic knowledge with real-world applications",
        "UniEmail":"info@eue.edu.eg",
        "UniPhone":"16323",
        "PrimaryLanguage":"English",
        "Website URL":"https:\/\/eue.edu.eg\/",
        "Picture URL":" "
    },
    { 
        "Name":"University of Central Lancashire",
        "Description":"The University of Central Lancashire (UCLan), hosted by the European University of Egypt (EUE), offers students in Egypt access to a globally recognized British education. Through this partnership, UCLan's diverse programs in fields such as business, law, engineering, health, and creative arts are delivered in a modern, supportive learning environment. EUE's facilities and resources ensure students receive a high-quality education aligned with UCLan's international standards. Graduates earn a UK-accredited degree, equipping them with the skills and qualifications to excel in their careers both locally and globally.",
        "Location":"New Capital City ",
        "Required Documents":"Original Diploma Certificate: Authenticated by relevant educational authorities.​\n\nOfficial Transcripts: Detailed records of academic performance.​\n\nProof of 12 Years of Schooling: Documentation verifying completion of the required years of education.​\n\nOriginal Birth Certificate: For identity verification.​\n\nPassport-Sized Photographs: Typically six recent photos.​\n\nMilitary Service Documents: Applicable to Egyptian male students, including Form 2 Gond and, if born in 2005 or earlier, a fully stamped Form 7 Gond.",
        "UniversityType":"International ",
        "Degree Type":"UK-accredited Degree ",
        "Rank":"Not Ranked",
        "LearningStyle":"a theoretical and practical learning approach, combining academic knowledge with real-world applications",
        "UniEmail":"info@eue.edu.eg",
        "UniPhone":"16323",
        "PrimaryLanguage":"English",
        "Website URL":"https:\/\/eue.edu.eg\/",
        "Picture URL":" "
    },
    {
     
        "Name":"University of East London",
        "Description":"The University of East London (UEL), hosted by the European University of Egypt (EUE), brings a modern, career-focused British education to Egypt. Through this partnership, students can access UEL's internationally recognized programs in fields like business, engineering, computing, and social sciences, all delivered in a state-of-the-art learning environment. EUE's campus provides a dynamic and supportive setting, combining UEL's global academic standards with local expertise. Graduates gain a UK-accredited degree, equipping them with the skills and qualifications to succeed in a competitive global job market.",
        "Location":"New Capital City ",
        "Required Documents":"Original Diploma Certificate: Authenticated by relevant educational authorities.​\n\nOfficial Transcripts: Detailed records of academic performance.​\n\nProof of 12 Years of Schooling: Documentation verifying completion of the required years of education.​\n\nOriginal Birth Certificate: For identity verification.​\n\nPassport-Sized Photographs: Typically six recent photos.​\n\nMilitary Service Documents: Applicable to Egyptian male students, including Form 2 Gond and, if born in 2005 or earlier, a fully stamped Form 7 Gond.",
        "UniversityType":"International ",
        "Degree Type":"UK-accredited Degree ",
        "Rank":"Not Ranked",
        "LearningStyle":"a theoretical and practical learning approach, combining academic knowledge with real-world applications",
        "UniEmail":"info@eue.edu.eg",
        "UniPhone":"16323",
        "PrimaryLanguage":"English",
        "Website URL":"https:\/\/eue.edu.eg\/",
        "Picture URL":" "
    },
    {
        
        "Name":"Coventry ",
        "Description":"Coventry University, in partnership with The Knowledge Hub Universities (TKH), established a branch campus in Egypt in September 2019. \n\n This collaboration offers students the opportunity to earn UK-accredited degrees without leaving Egypt, ensuring the same academic standards as those at Coventry's UK campus.\n\nAcademic Programs:\n\nThe Coventry University branch at TKH provides a diverse range of undergraduate programs across various disciplines:\n\nSchool of Business:\n\nBSc (Hons) Accounting and Finance\nBA (Hons) Advertising and Digital Marketing\nBA (Hons) Business and Human Resource Management\nBA (Hons) Business and Marketing\nBBA (Hons) Business Administration\nSchool of Engineering:\n\nBEng (Hons) Civil Engineering\nBEng (Hons) Electrical and Electronic Engineering\nBEng (Hons) Mechanical Engineering\nSchool of Computing:\n\nBSc (Hons) Computer Science\nBSc (Hons) Ethical Hacking and Cybersecurity\nBSc (Hons) Software Engineering\nSchool of Design and Media:\n\nBA (Hons) Digital Media\nBA (Hons) Film Production\nBA (Hons) Graphic Design\nBA (Hons) Interior Architecture and Design\nBA (Hons) International Fashion Business\nBA (Hons) Product Design\nPsychology Department:\n\nBSc (Hons) Psychology\nThese programs are designed to equip students with practical skills and knowledge, preparing them for global career opportunities. \n\n\nCampus Facilities:\n\nThe TKH campus, located in the New Administrative Capital of Egypt, is designed with a student-first approach, featuring:\n\nState-of-the-art laboratories and research centers\nModern classrooms equipped with advanced technology\nRecreational facilities, including sports areas\nSpaces dedicated to student associations and clubs\nThese facilities aim to foster innovation, personal growth, and a vibrant student life. \n\nCareer Services:\n\nCoventry University at TKH offers dedicated career services to support students' professional development, including:\n\nAssistance in securing internships\nOpportunities to connect with industry leaders\nField trips to gain practical insights\nThese services ensure that students graduate with a comprehensive understanding of the job market and are well-prepared for their chosen careers. \n\n\nThis partnership between Coventry University and The Knowledge Hub Universities exemplifies a commitment to delivering high-quality international education in Egypt, providing students with the tools and experiences necessary for success in a globalized world.",
        "Location":"New Capital City ",
        "Required Documents":"\nOfficial certificates and transcripts from previous educational institutions, such as high school diplomas or equivalent qualifications. \n\nProof of English Language Proficiency:\n\nAn IELTS (Academic or UKVI) certificate with an overall score of at least 6.0, with no less than 5.5 in each band. \n\nPersonal Statement:\n\nA written statement outlining your motivations for applying, career aspirations, and how the chosen program aligns with your goals.\nRecommendation Letter:\n\nA letter from an academic or professional referee attesting to your qualifications and suitability for the program.\nIdentification Documents:\n\nA copy of your national ID and passport.\nBirth Certificate:\n\nAn original computerized birth certificate.\nPhotographs:\n\nTwo recent passport-sized photos.\nMilitary Service Documents (for male applicants):\n\nMilitary forms (2 and 6) as required by Egyptian regulations.",
        "UniversityType":"International ",
        "Degree Type":"international UK-accredited degree.",
        "Rank":"Not Ranked",
        "LearningStyle":"Coventry University at TKH follows a practical, hands-on, and industry-focused learning approach, emphasizing project-based learning, real-world applications, and technology-driven education to prepare students for global careers.",
        "UniEmail":"admissions@tkh.edu.eg",
        "UniPhone":"19940",
        "PrimaryLanguage":"English",
        "Website URL":"https:\/\/tkh.edu.eg\/coventry-university-degree-egypt\/",
        "Picture URL":" "
    },
    {
      
        "Name":"Nova",
        "Description":"NOVA University Lisbon, a distinguished European institution, has established its first international branch at The Knowledge Hub Universities (TKH) in Egypt. This collaboration offers Egyptian and regional students access to globally recognized European degrees without leaving the country. NOVA is consistently ranked among the top 10 European universities under 50 years old, reflecting its commitment to excellence in teaching, research, and internationalization.\n\nAvailable Undergraduate Programs at NOVA Cairo:\n\nBSc Environmental Engineering: Focuses on sustainable solutions for environmental challenges.\nBSc Industrial Engineering and Management: Combines engineering principles with management strategies.\nBSc Information Management: Develops skills in organizing and analyzing organizational information.\nBSc Management: Offers comprehensive training in management, marketing, and business.\nThese programs are designed to equip students with the necessary skills to excel in a globalized job market, emphasizing innovation, analytical thinking, and practical application.\n\nBy enrolling at NOVA Cairo, students benefit from a curriculum aligned with European standards, experienced faculty, and a state-of-the-art campus environment, all while staying in Egypt. This initiative underscores TKH's mission to provide world-class education by hosting esteemed international universities.",
        "Location":"New Capital City ",
        "Required Documents":"\nOfficial certificates and transcripts from previous educational institutions, such as high school diplomas or equivalent qualifications. \n\nProof of English Language Proficiency:\n\nAn IELTS (Academic or UKVI) certificate with an overall score of at least 6.0, with no less than 5.5 in each band. \n\nPersonal Statement:\n\nA written statement outlining your motivations for applying, career aspirations, and how the chosen program aligns with your goals.\nRecommendation Letter:\n\nA letter from an academic or professional referee attesting to your qualifications and suitability for the program.\nIdentification Documents:\n\nA copy of your national ID and passport.\nBirth Certificate:\n\nAn original computerized birth certificate.\nPhotographs:\n\nTwo recent passport-sized photos.\nMilitary Service Documents (for male applicants):\n\nMilitary forms (2 and 6) as required by Egyptian regulations.",
        "UniversityType":"International ",
        "Degree Type":"internationally recognized European degrees accredited by NOVA University Lisbon.",
        "Rank":"Not Ranked",
        "LearningStyle":"NOVA University Lisbon at TKH emphasizes interactive, student-centered learning with a blend of theory, practical applications, and research-based projects, preparing students for real-world challenges through innovation and critical thinking.",
        "UniEmail":"hello@tkh.edu.eg",
        "UniPhone":"19940",
        "PrimaryLanguage":"English",
        "Website URL":"https:\/\/tkh.edu.eg\/nova-cairo-at-tkh\/",
        "Picture URL":" "
    },
    {
       
        "Name":"Unversiy Of Hertfordshire",
        "Description":"The University of Hertfordshire (UH), in collaboration with the Global Academic Foundation (GAF), established its first full-fledged branch campus in Egypt in 2019. Located on a 50-acre campus in the New Administrative Capital near the Golden Square, this partnership brings globally accredited UK undergraduate degrees to Egyptian students, maintaining the same academic standards as UH's UK campus. \n\nAcademic Programs:\n\nUH-GAF offers a diverse range of programs across multiple schools:\n\nSchool of Business:\n\nBA (Hons) Accounting and Finance\nBA (Hons) Business Administration\nBA (Hons) Advertising and Digital Marketing\nBA Business Management with Information Systems\nBA Business Management with Leadership and Management\nBSc Economics and Finance\nSchool of Creative Arts:\n\nBA (Hons) Digital Media Design\nBA (Hons) Interior Architecture and Design\nBA (Hons) Mass Communications\nSchool of Engineering and Computer Science:\n\nBEng (Hons) Mechanical Engineering and Mechatronics\nBEng (Hons) Civil Engineering\nBSc (Hons) Computer Science (Artificial Intelligence)\nBSc (Hons) Computer Science (Cyber Security and Networks)\nSchool of Health and Social Work:\n\nBSc (Hons) Physiotherapy\nSchool of Life and Medical Sciences:\n\nMPharm Pharmacy\nBSc (Hons) Pharmaceutical Science\nBSc Nutrition and Dietetics\nBSc Psychology\nThese programs are designed to provide practical, hands-on learning experiences, equipping students with skills relevant to the global job market. \nHERTS.AC.UK\n\nCampus Facilities:\n\nThe UH-GAF campus boasts state-of-the-art facilities, including:\n\nSports facilities with well-equipped gyms, football and tennis courts\nA comprehensive library\nLeisure rooms for relaxation and social activities\nDiverse food outlets\nTransportation services ensuring easy mobility for students\nThese amenities contribute to a vibrant student life, fostering both academic and personal growth. \n\n\nGlobal Recognition and Opportunities:\n\nStudents at UH-GAF are officially registered with the University of Hertfordshire in the UK and receive globally accredited British degrees upon graduation. They also have opportunities to study abroad at UH's UK campus for a semester or a full academic year, further enriching their educational experience. \n\n\nThis collaboration between UH and GAF exemplifies a commitment to delivering high-quality British education in Egypt, preparing students to excel in the global economy.",
        "Location":"New Capital City ",
        "Required Documents":"Official transcript of the high school certificate.\nRecent IELTS (Academic) or PTE (Academic) or TOEFL or Duolingo scores\nPhoto copy of National ID card or Passport.\nOfficial Birth Certificate\nA proof of 12 years of schooling for international certificates (11 years are accepted for IGCSE students)\n4 passport sized photographs.\nEvidence of military status (For males only).\nEvidence of military status (For males only). For those who are 18 years of more when applying\nنموذج 2 جند و نموذج 6 جند\nFor those who are less than 18 years when applying\nدليل صغار سن من منطقه التجنيد و نموذج 2 جند\nFor transfer students: Official Transcript for each college\/university attended, stamped course content\nOfficial medical report.",
        "UniversityType":"International ",
        "Degree Type":"UK DegeBritish degreeree",
        "Rank":"UnRanked",
        "LearningStyle":"Practical",
        "UniEmail":"admissions.UH-GAF@gaf.edu.eg",
        "UniPhone":"16192",
        "PrimaryLanguage":"English",
        "Website URL":"https:\/\/www.gaf.edu.eg\/",
        "Picture URL":" "
    },
  {

    "Name": "BUE",
    "Description": "The British University in Egypt (BUE) is a private university located in El Sherouk City, Cairo, Egypt. Established in 2005, BUE offers a British-style education in partnership with UK universities, ensuring that its degrees are recognized both in Egypt and internationally.\n\nKey Features of BUE:\n • UK-Based Education: The university follows a British higher education system, focusing on research, critical thinking, and independent learning.\n • International Recognition: Many programs are validated by British universities, allowing graduates to receive dual degrees.\n • Diverse Faculties: BUE offers programs in Engineering, Medicine, Pharmacy, Dentistry, Nursing, Business, Law, Political Science, Communication & Media, Arts & Design, and more.\n • Modern Campus: The university has state-of-the-art facilities, including advanced laboratories, libraries, and student activity centers.\n • Scholarships & Financial Aid: BUE provides various scholarships based on academic excellence and financial need.\n • Strong Industry Links: The university collaborates with businesses and organizations to enhance student employability through internships and career development programs.\n\nBUE aims to provide a high-quality education that prepares students for global careers while contributing to Egypt’s academic and professional landscape.",
    "Location": "El Sherouk City , Cairo, Egypt",
    "Required Documents": "To apply to The British University in Egypt (BUE), applicants must provide the following required documents:\n • Original Birth Certificate.\n • Six passport-sized photos.\n • Copy of the National ID card (for Egyptian students).\n • Completed Application Form.\n • Proof of English Proficiency, such as an IELTS score of at least 6.0 or APTIS. Students with IGCSE or International Baccalaureate (IB) certificates are exempt from this requirement.\n\nAdditionally, Egyptian male students may need to submit military service forms (Form 2 Gond & Form 6 Gond).",
    "UniversityType": "International ",
    "Degree Type": "Egyptian Degree – Accredited by the Supreme Council of Universities in Egypt.\n 2. British Degree – Validated by UK partner universities, ensuring international recognition.",
    "Rank": "10",
    "LearningStyle": "Adopts a UK-inspired system with a focus on critical thinking and research-driven education. Combines lectures, seminars, and practical labs, delivered in English, with an emphasis on international standards and partnerships with British universities.",
    "UniEmail": "info@bue.edu.eg",
    "UniPhone": "19283",
    "PrimaryLanguage": "English",
    "Website URL": "https:\/\/www.bue.edu.eg",
    "Picture URL": " "
  },
    {
        
        "Name":"THE EGYPTIAN RUSSIAN UNIVERSITY (ERU)",
        "Description":"The Egyptian Russian University strives to cultivate and enhance students’ scientific, physical, social, cultural, and artistic skills, aiming to graduate individuals sought after by the job market and capable of advancing our nation. A key objective is to bridge education, business, and society, fostering a culture of innovation. We urge you, dear student, to explore our university and join us in our journey towards success,",
        "Location":"Badr City",
        "Required Documents":"After completing the initial application, students are selected and accepted according to the highest total grades, within the allowed limits of the numbers and percentages, for both High School certificate, Arab and Foreign certificates and the minimum limits expected to be announced by the Ministry of Higher Education.\n\nDocuments required after announcing the final admission result:\n\nThe original high school diploma or its equivalent*\n\n*The original mechanized birth certificate showing the student’s triple number\n\n*A copy of the student’s national ID card and the guardian’s or passport.\n\n*A bank receipt after obtaining a payment permission from Student Affairs for the value of college expenses\n\n6 recent personal photos.",
        "UniversityType":"Private ",
        "Degree Type":"Accredited Bachelor’s degrees by Supreme Council of Egyptian Universities",
        "Rank":"30",
        "LearningStyle":"Adopts a credit-hour system with industry-aligned, innovation-driven programs.",
        "UniEmail":"info@eru.edu.eg\n",
        "UniPhone":"+0228609115",
        "PrimaryLanguage":"English",
        "Website URL":"https:\/\/eru.edu.eg\/",
        "Picture URL":" "
    },
    {
         
        "Name":"ECU",
        "Description":"The Egyptian Chinese University (ECU) was established by the presidential decision No. (118) for the year 2013. The Egyptian Chinese University is considered as the first technological, productive and non-traditional university based on productivity and techniques. The ECU is supposed to be consisted of 16 faculties that will start with 4 faculties and increase gradually in the following years to cover the remaining faculties.",
        "Location":"Gesr El Suez, Cairo",
        "Required Documents":"Secondary Certificate from Arab Countries\nEntry Requirements:\nA scientific-oriented Secondary Certificate is required for students willing to join the following faculties:\nPhysical Therapy\nPharmacy\nEngineering and Technology\nA non-scientific-oriented Secondary Certificate is required for students willing to join the following faculty:\nEconomics and International Trade\nAll Islamic subjects are not calculated during the evaluation of the final percentage.\nApplicant should achieve the minimum percentages announced by the Supreme Council of private Universities\nRequired Documents:\nOriginal Secondary School Certificate stamped by the Egyptian Embassy or Egyptian Ministry of Foreign Affairs\nSaudi Arabian Secondary Certificate must be presented with the General Abilities Test and The Student must provide the Admissions Department with user name and password\nYemenis Applicants must submit a proof of 12 years of schooling stamped by the school and certified by the Educational Zone the school belongs to.\nApplicants from Jordan, KSA, Kuwait, Yemen and Bahrain should issue a Recommendation letter by the Cultural Counsellor.\nOriginal birth certificate\nCopy of national ID (Egyptian students only) or Passport\nNew Six passport-size photos with white background\nMilitary form Istimara 2, 6 Gond (Egyptian males only)\nIGCSE\nEntry Requirements:\nApplicants should pass 8 qualifying subjects For the Faculty of Pharmacy & The Faculty of physical Therapy (English language or English literature, Mathematics, Chemistry, Biology, Physics and Any three additional subjects)\nFor the Faculty of Engineering and Technology: Math (ASL) or (AL) is required in addition to the 8 (OL) subjects (English language or English literature, Mathematics, Chemistry, Physics and Any four additional subjects)\n8 (OL) subjects are required (English language or English literature and Any 7 additional subjects) For the Faculty of Economics &International Trade\nMinimum grade for the (OL) subjects is “C” or “4”\nMinimum grade for the (ASL or AL) is “D” or “4″\nAccepted grades must be taken from all exam sessions studied during 4 years as maximum.\nIGCSE (OL) subjects obtained from Arab Countries should be of the (extended), not of the (core) system.\nPhysical Education, Religion, Military Sciences, General Science, Music, Classical Arabic, and Arabic as a Second Language are not accepted.\nRequired Documents:\nIGSCE-Slips must be stamped and verified by the British Council and certified by the Ministry of Foreign Affairs in Cairo plus stamped from General Administration for Examination\nFor IGCSE Slips obtained from outside must be stamped from f the British Council, Ministry of Foreign Affairs and Egyptian Embassy in the country of certificate.\nProof of twelve years of schooling or original Preparatory School Certificate (Edadya) must be stamped by School and certified by the Educational Zone the school belongs to.\nOriginal results of Arabic\/Religion examinations. (Arab Nationalities)\nOriginal birth certificate\nCopy of national ID (Egyptian students only) or Passport\nNew Six passport-size photos with white background\nMilitary form Istimara 2, 6 Gond (Egyptian males only)\nAmerican Diploma\nEntry Requirements:\n8 School subjects are required with at least 1 credit hour with an official transcript For the Faculty of physical Therapy and The Faculty of Pharmacy (English language or English literature, Mathematics, Chemistry, Biology, Physics and Any three additional subjects), For the Faculty of Economics &International Trade (English language or English literature and Any 7 additional subjects) and For the Faculty of Engineering and Technology( Advanced Mathematics or SAT 2 (Mathematics) is required in addition to the 8 subjects (English language or English literature, Mathematics, Chemistry, Physics and Any four additional subjects)\nSubjects less than 1 credit are not accepted.\nSubjects can be calculated from Grade 12, 11 or 10. Minimum number of subjects to be calculated from G12 is 4, maximum number of subjects from G11 is 4 and maximum number of subjects to be calculated from G10 is 2.\nStudents who spent (1, 2 or 3) academic years in the American Diploma system can apply to university in condition to meet all requirements needed to join the aimed faculty.\nPE, music and religion are not counted.\nSAT I\/ACT1\/EST1 minimum Score is 800 and this score is considered as a passing grade and does not guarantee acceptance.\nSAT II\/ACT2\/EST2 minimum accepted score is 900 although its optional but is highly recommended for the student as it gives extra bonus for the student’s overall percentage.\nSAT II\/ACT2\/EST2 (math in addition to any other scientific subject) will be obligatory for the student willing to join the Faculty of Engineering and Technology in case they didn’t study the Advanced Math in the school subjects in grades 10, 11 or 12(Please note that Languages as French and subjects like history are not accepted in SATII)\nRequired Documents:\nOriginal Final High School Transcript (GPA) attained from Egypt must be stamped by the school in addition to the stamp of the General Administration for Examination in Egypt, for certificates obtained from schools outside Egypt – stamp of school ,the U.S. Accreditation Institution and Ministry of Education, stamp of Ministry of Foreign Affairs of country of the certificate and stamp of Egyptian Embassy in country of certificate are required.\nDiplomas obtained from international (American division) schools in Egypt must submit “إفادة التعليم الخاص” private & International education Department verification list for the school.\nSAT \/ACT\/EST Score(s) original certificates must be stamped by the AMID-EAST and Ministry of Foreign Affairs.\nStudent must provide the Admissions Department with user name and password for their account of the College Board.\nDiplomas obtained from schools outside Egypt an Accreditation Letter from AMID-EAST is required and must be stamped by the AMID-EAST and Ministry of Foreign Affairs.\nProof of twelve years of schooling or original Preparatory School Certificate (Edadya) must be stamped by School and certified by the Educational Zone the school belongs to.\nFor the proof of twelve years of schooling obtained from outside Egypt it must be stamped by the Ministry of Foreign Affairs and the Egyptian Embassy in that foreign country.\nOriginal results of Arabic\/Religion examinations. (Arab Nationalities).\nOriginal birth certificate\nCopy of national ID (Egyptian students only) or Passport\nNew Six passport-size photos with white background\nMilitary form Istimara 2, 6 Gond (Egyptian males only)\nThe International Baccalaureate. (IB)\nEntry Requirements:\nAchieving 6 subjects including 3 high level subjects.\nApplicants must pass the English Language to get accepted.\nThe Minimum score is 24 out of 45.\nThe Extended Essay and Theory of Knowledge are required but not counted as one of the 6 required subjects.\nApplicants must submit both the final certificate and the final graduation IB Diploma to be considered for admissions.\nMath (HL) & Physics (HL) are required for the Faculty of Engineering and the Faculty of Computers and IT.\nBiology (HL) & Chemistry (HL) are required for the Faculty of Oral and Dental Medicine and the Faculty of Pharmaceutical Sciences and Pharmaceutical Industries.\nRequired Documents:\nFinal IB Transcript and Graduation Diploma (should be in English) authorized by the authorities concerned in Switzerland – Genève, the Egyptian Embassy in Switzerland in addition to the stamp of General Administration for Examination in Egypt.\nFor certificates obtained from outside Egypt it must be stamped from the authorities concerned in Switzerland – Genève and the Egyptian Embassy in Switzerland.\nProof of twelve years of schooling or original Preparatory School Certificate (Edadya) must be stamped by School and certified by the Educational Zone the school belongs to.\nFor the proof of twelve years of schooling obtained from outside Egypt must be stamped from the Ministry of Foreign Affairs and the Egyptian Embassy in that foreign country.\nOriginal results of Arabic\/Religion examinations. (Arab Nationalities)\nOriginal birth certificate\nCopy of national ID (Egyptian students only) or Passport\nNew Six passport-size photos with white background\nMilitary form Istimara 2, 6 Gond (Egyptian males only)\nCanadian High School Diploma\nEntry Requirements:\nApplicants should pass 8 subjects, in addition to Advanced Math if willing to study in the Faculty of Engineering and the Faculty of Computers and IT.\nApplicants who studied all their courses in one or two year(s) only (grade 11 and \/or 12) in the Canadian system will not be considered for admission.\nSubjects are calculated from Grade 12 & 11 only. Minimum number of subjects to be calculated from G12 is 5 in addition to Advanced Math; maximum number of subjects to be calculated from G11 is 3.\nSubjects less than one credit are not accepted.\nRequired Documents:\nOriginal Final High School Transcript (GPA) attained from Egypt must be stamped by the General Administration for Examination in Egypt.\nFor certificates obtained from schools outside Egypt – stamp of Egyptian Embassy in Montreal-CANADA is required\nProof of twelve years of schooling or original Preparatory School Certificate (Edadya) must be stamped by School and certified by the Educational Zone the school belongs to.\nFor the proof of twelve years of schooling obtained from outside Egypt must be stamped from the Ministry of Foreign Affairs and the Egyptian Embassy in that foreign country.\nOriginal results of Arabic\/Religion examinations. (Arab Nationalities)\nOriginal birth certificate\nCopy of national ID (Egyptian students only) or Passport\nNew Six passport-size photos with white background\nMilitary form Istimara 2, 6 Gond (Egyptian males only)\nAbitur Certificate\nEntry Requirements:\nGrade 12 must have been completed.\nThe official transcript must include seven subjects, one of which is English language, with a minimum score of 3\nAvailability to calculate one of The qualifying subjects from The Grade 10.\nRequired Documents:\nAbitur-Certificate should be stamped by the school, the German Embassy and certified by the Ministry of Foreign Affairs in addition to the stamp of the General Administration for Examination in Egypt, Cairo.\nAbitur Certificate should be translated into English or Arabic and stamped from the Ministry of Foreign Affairs in Egypt.\nProof of twelve years of schooling must be stamped by School and certified by the Educational Zone the school belongs to.\nFor the proof of twelve years of schooling obtained from outside Egypt must be stamped from the Ministry of Foreign Affairs and the Egyptian Embassy in that foreign country.\nOriginal results of Arabic\/Religion examinations. (Arab Nationalities)\nOriginal birth certificate\nCopy of national ID (Egyptian students only) or Passport\nNew Six passport-size photos with white background\nMilitary form Istimara 2, 6 Gond (Egyptian males only)\nNigerian Secondary Certificate\nEntry Requirements:\nStudents willing to join the Faculty of Engineering and the Faculty of Computers & IT must study the following obligatory subjects:\nEnglish\nPhysics\nChemistry\nMathematics\nFurther Mathematics\nStudents willing to join the Faculty of Oral and Dental Medicine and the Faculty of Pharmaceutical Sciences & Pharmaceutical Industries must study the following obligatory subjects:\nEnglish\nPhysics\nChemistry\nMathematics\nBiology\nStudents willing to join the faculty of Commerce & Business Administration and the Faculty of economics & Political Science must study the following subjects:\nEnglish (Obligatory)\nAny other subjects from the following list: (Physics\/Chemistry\/Mathematics\/Biology\/History\/Economics\/Computer\/ Accounting\/Geography \/ Hausa)\nRequired Documents:\nOriginal electronic certificate certified by the Ministry of Foreign Affairs in Cairo.\nOriginal Birth Certificate or a certified copy stamped by the Egyptian Embassy in the foreign country and the Ministry of Foreign Affairs in Cairo.\nA letter from the Nigerian Embassy mentioning and proofing that the Nigerian student mentioned above has completed his secondary school education in Nigeria and is qualified to be enrolled into any university within or outside Nigeria, mentioning the grades of the statement & the key marks and should be validated from the Ministry of foreign affairs in Cairo.\nAccomplished 12 years of education in Nigeria and should be validated from the Ministry of Foreign Affairs in Cairo.\nStudents should provide the scratch card with the user name & password on WAEC DIRECT or NECO result to ensure on the student results.\nOriginal birth certificate\nCopy of national ID (Egyptian students only) or Passport\nNew Six passport-size photos with white background\nMilitary form Istimara 2, 6 Gond (Egyptian males only)",
        "UniversityType":"Private ",
        "Degree Type":"Accredited Bachelor’s degrees by Supreme Council of Egyptian Universities",
        "Rank":"50",
        "LearningStyle":"Focuses on a bilingual (English and Chinese) education model with an emphasis on cultural exchange and technical skills. Combines theoretical lectures with practical training, particularly in engineering, business, and medicine, aiming to prepare students for Egyptian-Chinese collaboration.",
        "UniEmail":"info@ecu.edu.eg",
        "UniPhone":"26350005",
        "PrimaryLanguage":"English , Chinese",
        "Website URL":"ecu.edu.eg",
        "Picture URL":" "
    },
    {
         
        "Name":"Horus",
        "Description":"Horus University is a private institution located in New Damietta, Egypt. The university aims to provide high-quality education in applied and technological sciences, focusing on academic excellence and adherence to international educational standards.\n\nThe university offers a range of faculties, including the Faculty of Health Sciences Technology, which prepares graduates to excel in competitive job markets. Horus University is also open for applications for the\n 2024\/2025 academic year,\n welcoming students from both national and\n international backgrounds.",
        "Location":"New Damietta,\n Egypt",
        "Required Documents":"High School Certificate (or equivalent): Official transcripts or a copy of your secondary school certificate.\nBirth Certificate: A copy of your official birth certificate.\nNational ID or Passport: A copy of your ID card (for Egyptian students) or passport (for international students).\nPassport-size Photos: Usually 4-6 recent passport-sized photographs.\nApplication Form: A completed application form available on the university's website or admission office.\nProof of Residence: For Egyptian students, a copy of your residence proof.\nMedical Report: Some universities may require a medical certificate from an authorized hospital.\nEnglish Proficiency Test Scores (if applicable): For international students or those applying for programs taught in English, proof of English language proficiency (e.g., TOEFL, IELTS) may be required.",
        "UniversityType":"private",
        "Degree Type":"Accredited Bachelor’s degrees by Supreme Council of Egyptian Universities",
        "Rank":"35",
        "LearningStyle":"Blended approach with face-to-face and online learning (via Microsoft Teams), focusing on practical, career-oriented education, hands-on training, and research in fields like engineering and medicine.",
        "UniEmail":"info@horus.edu.eg ",
        "UniPhone":"01144455582",
        "PrimaryLanguage":"Arabic as the main language \nEnglish.",
        "Website URL":"https:\/\/horus.edu.eg\/",
        "Picture URL":" "
    },
    {
         
        "Name":"SUE",
        "Description":"Alsalam University in Egypt (SUE) is a private university\n located in the Delta region, established in 2018.\n It aims to provide quality education based on both \nnational and international standards. \nThe university focuses on academic excellence, \npractical knowledge, and research, offering programs \nin fields like Dentistry, Physiotherapy, Pharmacy, Nursing, Applied Arts, and Engineering.",
        "Location":"Banha, in the \nQalyubia Governorate, Egypt",
        "Required Documents":"High School Certificate or Equivalent: Original and a copy.\nNational ID: Valid for both the student and the guardian.\nRecent Birth Certificate: Original copy.\nRecent Passport-sized Photos: 6 photos, 4x6 cm.\nMilitary Service Form (for male applicants): Only required for male applicants.",
        "UniversityType":" private",
        "Degree Type":"Accredited Bachelor’s degrees by Supreme Council of Egyptian Universities",
        "Rank":"60",
        "LearningStyle":"Practical, excellence-driven, with lectures and hands-on training in fields like dentistry and pharmacy, focusing on innovation, research, and market-ready skills.",
        "UniEmail":"info@sue.edu.eg",
        "UniPhone":"19610",
        "PrimaryLanguage":"Arabic is the\n primary language ",
        "Website URL":"https:\/\/sue.edu.eg\/",
        "Picture URL":" "
    },
    { 
        "Name":"Sphinx",
        "Description":"The University is in the center of the new city of Assuit, where all services are located from commercial centers and schools. The University is mediated by a group of State and private universities, hospitals and urban housing complexes surrounding the University, which provide the student with the opportunity to provide adequate housing at appropriate prices, as well as security and safety services. This makes it possible for the student to find everything he or she needs during his or her studies at the University.",
        "Location":"Assiut, Egypt",
        "Required Documents":"Full application form (Electronically)\n\n- For foreign certificates: supplying the original certification certified from the Egyptian embassy or the Egyptian ministry of foreign Affairs.\n\n- Six new personal photographs.\n\n- Certificate of birth or official extract (Computer one).\n\n- For Arab students: must certify the qualification or supply the original passport\n\n- Egyptian male students should apply “2 Gond form from the recruitment region”.\n\n- Egyptian male students, who are over 19 years old, apply “6 Gond forms from a police station that follows his residence”.\n\n- Students who have not exceed 22 years old on 1st of September in the same year of application, should presents their military status.\n\n- Non-Egyptian students should apply a copy of the ID (passport).",
        "UniversityType":"private",
        "Degree Type":"Accredited Bachelor’s degrees by Supreme Council of Egyptian Universities",
        "Rank":"UnRanked",
        "LearningStyle":"Focuses on practical, research-driven education with lectures, labs, and community development projects, delivered in English, across fields like dentistry, pharmacy, and engineering.",
        "UniEmail":"Info@Sphinx.edu.eg",
        "UniPhone":"+201555500888",
        "PrimaryLanguage":"English",
        "Website URL":" https:\/\/sphinx.edu.eg\/en\/home\/index",
        "Picture URL":" "
    },
    {
        
        "Name":"KSIU",
        "Description":"King Salman International University (KSIU) \nis a smart university with international standards \nand special nature that seeks to provide the \ncommunity with future leaders and innovators capable of making tangible changes to themselves and their country. The University aims at competing in the area of science and technology and culture development at an international level.",
        "Location":"Sharm El Sheikh, Ras Sidr, and Al Tur",
        "Required Documents":"High School Certificate or Equivalent: Original, authenticated by the Egyptian Ministry of Foreign Affairs and the relevant embassy.\nBirth Certificate: Original copy.\nNational ID: A copy, with the original available for verification.\nRecent Passport-sized Photos: 6 recent photos, 4x6 cm, with a white background.\nMilitary Service Forms (Form 2 and Form 6): Required for male applicants.",
        "UniversityType":"International",
        "Degree Type":"Accredited Bachelor’s degrees by Supreme Council of Egyptian Universities",
        "Rank":"UnRanked",
        "LearningStyle":"Adopts a smart, innovative approach with a credit-hour system, blending IoT-based smart campuses, interactive classrooms, and practical training. Focuses on global market needs, research, and interdisciplinary learning in English across its three Sinai campuses.",
        "UniEmail":"info@ksiu.edu.eg",
        "UniPhone":"16949",
        "PrimaryLanguage":"English",
        "Website URL":"https:\/\/ksiu.edu.eg\/",
        "Picture URL":" "
    }
]